[
	{"title":"Havok","content":"I've decided that Roblox's Mod will use a custom version of Havok instead of the default physics engine. \n\nThough I'm not too sure how implementable this is. \n\nAnyway the important part is that develoment is going smooth, long but smooth.","date":[2021,3,5]},
	{"title":"Source Engine","content":"I'm currently getting all the meta stuff running for my implementation of the Source Engine in Roblox. This is gonna take while, dont know if ill update much in the mean time.","date":[2021,3,5]},
	{"title":"Singleplayer","content":"More work on singleplayer, ive decided the best coarse of action is to get singleplayer working before getting the editing tools started.","date":[2021,3,4]},
	{"title":"Gmod Content","content":"Alot of work in the past 3 days, finished a module that literally just imports the code from the Gmod Github page and uses it for the base game content. Of coarse now I need to translate gLua to Luau, which wont be too difficult, expect a beta build open in not too long.","date":[2021,2,26]},
	{"title":"Gmod Experts?","content":"By far the most difficult part of this is understanding how gmod addons work. It's nice that they use lua but the file structure is completely alien to me. If anyone knows a fair bit about gmod addons, id love to have you on the team for a little. Contact me through the upcoming discord!","date":[2021,2,23]},
	{"title":"Addon Service","content":"AddonService is being implemented, basically all the functions that addons will be able to access. Not much else to mention.","date":[2021,2,22]},
	{"title":"More Editor Progress","content":"More work on the script compiler, should be close to completion. Thankfully GMod uses Lua just like Roblox so it isnt a complete mess yet.","date":[2021,2,21]},
	{"title":"Editor Progress","content":"The Addon Editior is coming along well, currently working on the script compiler, this will likely take the most amount of time. Expect nearly daily updates on progress for now.","date":[2021,2,19]},
	{"title":"Updates!","content":"Fixed the Latest Update System. Instead of reading the Roblox Update System, which other people cant, it now uses the Roblox's Mod Github Repository. This means it might not be changed for every update, I cant trust myself to do that, but at least it works. \n\nWork has been postponed quite a-bit recently with the combustion of my computer's PSU, still working on it but just on my laptop. \n\nIn the background im rewritting the addon editor, so expect that to come soon.","date":[2021,2,18]}
]
